# Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке строк некое число.

a = [1, 123, 12, 352315]
num = 124
print(num in a)
